_Rarzrabotki/BASEBuh/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ВидыОперацийПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСредствОтФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПродажаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ОбъектыСтроительства</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Comment>(Общ) Организация-изготовитель</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автотранспорт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ИдКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/BASEBuh/CommonModules/_ДопРасчеты/Ext/Module.bsl
Процедура _ПроводкиПоЕдиномуНалогуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если УчетнаяПолитика.ПлательщикЕдиногоНалога(Источник.Организация,Источник.Дата) Тогда 
		НаборДвижений = Источник.Движения.КнигаДоходовРасходовПоЕдиномуНалогу; 
		НаборДвижений.Очистить();
		НомерДокумента = "ПВ"+" "+Источник.Номер;    
		Для Каждого СтрокаДвижений Из Источник.Движения.Хозрасчетный Цикл  
			
			Если СтрокаДвижений.СчетКт = ПланыСчетов.Хозрасчетный.ДоходОтОперационнойКурсовойРазницы Тогда 
				
				
				Если НЕ ЗначениеЗаполнено(Источник.Субконто2ДоходовКурсоваяРазница) ИЛИ Источник.Субконто2ДоходовКурсоваяРазница = Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходомНеПризнается Тогда
					Продолжить;
				КонецЕсли;	
				
				Строка = НаборДвижений.Добавить(); 
				Строка.Регистратор = Источник.Ссылка;
				Строка.Период     	  = Источник.Дата;
				Строка.Организация    = СтрокаДвижений.Организация;
				Строка.Статья    	  = Источник.Субконто2ДоходовКурсоваяРазница;
				Строка.Сумма    	  = СтрокаДвижений.Сумма;
				Строка.НомерПлатежногоДокумента = НомерДокумента;
				НаборДвижений.Записывать = Истина; 
				
			КонецЕсли;
			
		КонецЦикла;  
		
	//	НаборДвижений.Зписать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура _ЗакрытиеМесяцаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт    
	Если Источник.РасчетСтоимостиПродукции Тогда   
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
		|	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
		|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
		|	ХозрасчетныйОстатки.НалоговоеНазначение КАК НалоговоеНазначение
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков, Счет = &Счет231, , Организация = &Организация) КАК ХозрасчетныйОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.Субконто2,
		|	ХозрасчетныйОстатки.Субконто1,
		|	ХозрасчетныйОстатки.НалоговоеНазначение,
		|	ХозрасчетныйОстатки.Субконто3";
	МомВрем = Источник.Ссылка;
	Запрос.УстановитьПараметр("ДатаОстатков", КонецМесяца(Источник.Дата)+1);
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	Запрос.УстановитьПараметр("Счет231", ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборДвижений = Источник.Движения.Хозрасчетный; 
	Пока Выборка.Следующий() Цикл  
		НоваяПроводка = НаборДвижений.Добавить();
		НоваяПроводка.Организация = Источник.Организация;
		НоваяПроводка.Активность  = Истина;  
		НоваяПроводка.регистратор = источник.Ссылка;
		НоваяПроводка.Период      = Источник.Дата;
		НоваяПроводка.Содержание  = НСтр("ru='Корректировка выпуска продукции (услуг)';uk='Коригування випуску продукції (послуг)'",Локализация.КодЯзыкаИнформационнойБазы());
		
		НоваяПроводка.Сумма       = Выборка.СуммаОстатокДт; 
		НоваяПроводка.НалоговоеНазначениеДт = Выборка.НалоговоеНазначение;   
		НоваяПроводка.НалоговоеНазначениеКт = Выборка.НалоговоеНазначение;
		НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойГотовойПродукции;
		БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 1, Выборка.Субконто2);
		БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 2, Выборка.Субконто3);
		//БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетДт, НоваяПроводка.СубконтоДт, 3, Обход.СубконтоСписания3);
		
		НоваяПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
		//БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "Подразделения",        Обход.Подразделение);
		//БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, "НоменклатурныеГруппы", Обход.НоменклатурнаяГруппа);
		БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 1, Выборка.Субконто1);
		БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 2, Выборка.Субконто2);
		БухгалтерскийУчет.УстановитьСубконто( НоваяПроводка.СчетКт, НоваяПроводка.СубконтоКт, 3, Выборка.Субконто3);
	
		
		
	КонецЦикла;
	
	// мПроводкиБУ = Движения.Хозрасчетный;
	ПроведениеСервер.ЗаписатьНаборЗаписейБезЗамещенияТекущихДвижений(НаборДвижений);

	     
	КонецЕсли;

КонецПроцедуры

Процедура _ПередЗаписьюЗПВедомостиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Источник.СуммаДокумента = Источник.РаботникиОрганизации.Итог("Сумма");
КонецПроцедуры


Процедура _ПередЗаписьюОСПередЗаписью(Источник, Отказ) Экспорт
		
	Если ЗначениеЗаполнено(Источник._Организация) И НЕ ЗначениеЗаполнено(Источник.Код) Тогда  
	//	Источник._Организация = Организация;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		//|	ДоговорыКонтрагентов.Номер КАК Номер
		//|ИЗ
		//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		//|ГДЕ
		//|	ДоговорыКонтрагентов._ВидВзаиморасчетов = &ВидВзаиморасчетов
		//|	И ДоговорыКонтрагентов.Номер <> &Пустой
		//|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка
		//|	И ДоговорыКонтрагентов.Номер ПОДОБНО &НомерДокумента
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Номер УБЫВ";  
		
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОсновныеСредства.Код КАК Код
		|ИЗ
		|	Справочник.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Код ПОДОБНО &Код
		|	И ОсновныеСредства.Ссылка <> &Ссылка
		|	И ОсновныеСредства._Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
		
		Запрос.УстановитьПараметр("Организация", Источник._Организация);  
		//Запрос.УстановитьПараметр("Пустой", "");      
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка); 
		Запрос.УстановитьПараметр("Код", Источник._Организация.Префикс+"%"); 

		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			НомерСтрокой = СтрЗаменить(Выборка.Код,Источник._Организация.Префикс+"-","");  
			НомерЧислом = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерСтрокой);  
			Попытка    
				НомерЧисломНовый = НомерЧислом+1;
				Источник.Код = Источник._Организация.Префикс+"-" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерЧисломНовый,6); 
			Исключение  
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Источник.Код = Источник._Организация.Префикс+"-" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1",6);
		КонецЕсли;
	//ИначеЕсли НЕ ЗначениеЗаполнено(Источник._Организация)	Тогда  
	//	Отказ = Истина;
	//	Сообщить("Вкажіть організацію!");
		
	КонецЕсли;

КонецПроцедуры


//Партионный учет списания производим по партиям подразделения
Процедура УстановитьФильтрПартии(ФильтрПартии,Документ,Номенклатура,МассивСчетовУчетаБУ,МассивСкладов,МассивНалоговыхНазначений) Экспорт 
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КомплектацияНоменклатуры") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ТребованиеНакладная")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеТоваров") ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПередачаМалоценныхАктивовВЭксплуатацию") Тогда
		Если ЗначениеЗаполнено(Документ.Подразделение) Тогда  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.Субконто2 КАК Партия
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата,
			|			Счет В (&МассивСчетовУчетаБУ),
			|			,
			|			Субконто1 В (&Номенклатура)
			|				И Организация = &Организация
			|				И Субконто2.Подразделение = &Подразделение
			|				И НалоговоеНазначение В (&НалоговоеНазначение)
			|				И Субконто3 В (&МассивСкладов)) КАК ХозрасчетныйОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстатки.Субконто2";
			
			Запрос.УстановитьПараметр("Дата", Документ.Дата-1);   
			Запрос.УстановитьПараметр("МассивСчетовУчетаБУ", МассивСчетовУчетаБУ);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
			Запрос.УстановитьПараметр("НалоговоеНазначение", МассивНалоговыхНазначений);
			//	Запрос.УстановитьПараметр("Документ", Документ);
			
			Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение);
			Запрос.УстановитьПараметр("Организация", Документ.Организация);
			
			ФильтрПартии = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партия");
		КонецЕсли;   
		
	ИначеЕсли  ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
		
		Если ЗначениеЗаполнено(Документ.Подразделение1) Тогда  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.Субконто2 КАК Партия
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Дата,
			|			Счет В (&МассивСчетовУчетаБУ),
			|			,
			|			Субконто1 В (&Номенклатура)
			|				И Организация = &Организация
			|				И Субконто2.Подразделение = &Подразделение
			|				И НалоговоеНазначение В (&НалоговоеНазначение)
			|				И Субконто3 В (&МассивСкладов)) КАК ХозрасчетныйОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстатки.Субконто2";
			
			Запрос.УстановитьПараметр("Дата", Документ.Дата-1);   
			Запрос.УстановитьПараметр("МассивСчетовУчетаБУ", МассивСчетовУчетаБУ);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
			Запрос.УстановитьПараметр("НалоговоеНазначение", МассивНалоговыхНазначений);
			//	Запрос.УстановитьПараметр("Документ", Документ);
			
			Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение1);
			Запрос.УстановитьПараметр("Организация", Документ.Организация);
			
			ФильтрПартии = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партия");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьНаправлениеПодразделениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда 
		
		Если  Источник.ВидОперации  = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя 
			ИЛИ  Источник.ВидОперации  = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда 
			
			Для Каждого Строка Из Источник.РасшифровкаПлатежа Цикл  
				Договор = Строка.ДоговорКонтрагента;
				Отказ = ПроверкаНаправлениеПодразделение(Источник, Договор,Отказ);
			КонецЦикла;    
			
		КонецЕсли;
	Иначе     
		Договор = Источник.ДоговорКонтрагента;
		Отказ = ПроверкаНаправлениеПодразделение(Источник, Договор,Отказ);
	КонецЕсли;
	
	
КонецПроцедуры   

Функция ПроверкаНаправлениеПодразделение(Источник, Договор,Отказ) 
	
	Если  Источник.Направление <>  Договор.Направление Тогда  
		Отказ = Истина;
		Сообщить("Направлення в документі: " + Источник.Направление+  " не відповідає направленню в договорі: " + Договор.Направление);
	КонецЕсли;
	
	Если  Источник.Подразделение <>  Договор.Подразделение Тогда  
		Отказ = Истина;
		Сообщить("Підрозділ в документі: " + Источник.Подразделение+  " не відповідає підрозділу в договорі: " + Договор.Подразделение);
	КонецЕсли;    
	
	Возврат Отказ;
	
КонецФункции
